package by.lessons.practics.class3;

//4 В классе main создать массив из пяти книг
class Main {
    public static void main(String[] args) {

        Book[] books = new Book[5];
        books[0] = new Book(1, "Три мушкетера", "Александр Дюма", "Дом печати", 2020, 456, 65.32);
        books[1] = new Book(2, "Война и мир", "Лев Толстой", "Литрес", 1954, 658, 75.92);
        books[2] = new Book(3, "Хоббит", "Джон Рональд Руэл Толкин", "Дом печати", 1937, 523, 44.17);
        books[3] = new Book(4, "И никого не стало", "Агата Кристи", "Литрес", 1939, 456, 68.22);
        books[4] = new Book(5, "Гарри Поттер и философский камень", "Джоан Роулинг", "Дом печати", 1997, 712, 89.36);


        // Вывод информации о всех книгах
        for (
                Book book : books) {
            book.info();
        }

        // Изменение цены на первую книгу
        books[0].

                changePrice(70.99);
        System.out.println("После изменения цены:");
        books[0].

                info();

    }
}
