package by.lessons.practics.class1.part1;

public class Task1 {
    // 1. Дано уравнение: (10+12)*x=88;. Найти значение x.
    //Наведите курсор на сообщение, чтобы закрепить его
    //keep
    public static void main(String[] args) {

        int x =88/(10+12);
        System.out.println("Значение x: " + x);
    }
}
